Store/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Store/src/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстСообщения = "Поменялась цена";
	
	РассчитатьСуммуВСтроке(ТекущиеДанные, ТекстСообщения);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстСообщения = "Поменялось количество";
	
	РассчитатьСуммуВСтроке(ТекущиеДанные, ТекстСообщения);

КонецПроцедуры

#КонецОбласти
&НаКлиенте
Процедура Команда1(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуВСтроке(Строка, ТекстПользователю)

	Строка.Сумма = Строка.Количество * Строка.Цена * 0.9;
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстПользователю;
	Сообщение.Сообщить();
	
	Сотрудник = ОписаниеПользователя();
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = Сотрудник.Имя;
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Функция ОписаниеПользователя()
	
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("Стаж", 15);
	Человек.Вставить("ДатаПриема", ТекущаяДата());
	Человек.Вставить("Штатный", Истина);
	
	Возврат Человек;
	
КонецФункции


#КонецОбласти
